Revit 2026 API

# SpatialElementName Property

---

A human readable name for the Element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public override string Name { set; }
```
```vb
Public Overrides WriteOnly Property Name As String
	Set
```
```cpp
public:
virtual property String^ Name {
	void set (String^ value) override;
}
```
```fsharp
abstract Name : string with set
override Name : string with set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the name of the element cannot be changed. |
| ArgumentException | Thrown when the element requires a unique name and a non-unique name is set. |

The Name property is a human readable name for the element, such as Wall.

#### Reference

SpatialElement Class

Autodesk.Revit.DB Namespace